docs/old/f24/liskov-notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-05 Mon 20:58 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgf0c1fb2">1. Procedural Abstraction and Design by Contract</a>
<ul>
<li><a href="#org50dd040">1.1. Benefits of Abstraction</a></li>
<li><a href="#orgfd2728b">1.2. Abstraction by Specification</a></li>
<li><a href="#orgd4250dd">1.3. Specifications</a></li>
<li><a href="#org5e86183">1.4. Parts of a Procedural Specification</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf0c1fb2" class="outline-2">
<h2 id="orgf0c1fb2"><span class="section-number-2">1</span> Procedural Abstraction and Design by Contract</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org50dd040" class="outline-3">
<h3 id="org50dd040"><span class="section-number-3">1.1</span> Benefits of Abstraction</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>Locality
<ul class="org-ul">
<li>The implementation of an abstraction can be read or written without needing to examine the implementations of any other abstractions</li>
</ul></li>
<li>Modifiability
<ul class="org-ul">
<li>An abstraction can be reimplemented without requiring changes to any abstractions that use it</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgfd2728b" class="outline-3">
<h3 id="orgfd2728b"><span class="section-number-3">1.2</span> Abstraction by Specification</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Abstraction \(\mapsto\) Implementation 1 \(\dots\) Implementation N
</p>
</div>
</div>


<div id="outline-container-orgd4250dd" class="outline-3">
<h3 id="orgd4250dd"><span class="section-number-3">1.3</span> Specifications</h3>
<div class="outline-text-3" id="text-1-3">
<ul class="org-ul">
<li>Way to Define Abstractions</li>
<li>Formality
<ul class="org-ul">
<li>As much as is useful</li>
<li>More than just English</li>
<li>Typically less than a language with a formal semantics</li>
<li>We will be close to industry standard (ie Javadoc)</li>
<li>Not intended to be a programming language!</li>
</ul></li>
</ul>
</div>
</div>


<div id="outline-container-org5e86183" class="outline-3">
<h3 id="org5e86183"><span class="section-number-3">1.4</span> Parts of a Procedural Specification</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">
<pre class="src src-java">
<span style="color: #e45649;">public</span> <span style="color: #e45649;">static</span> <span style="color: #986801;">int</span> <span style="color: #a626a4;">sortedSearch</span> (<span style="color: #986801;">int</span>[]<span style="color: #6a1868;">a</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">x</span>)
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Requires:  a is sorted in ascending order</span>
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Effects:   if x is in a returns an index where </span>
<span style="color: #9ca0a4;">//  </span><span style="color: #9ca0a4;">x is stored; otherwise, returns -1</span>

</pre>
</div>

<ul class="org-ul">
<li>Precondition (Requires): Anything missing? What happens in other languages?  (e.g., C++)</li>
<li>Postcondition (Effects)</li>
</ul>


<div class="org-src-container">
<pre class="src src-java"><span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Another example</span>
<span style="color: #e45649;">public</span> <span style="color: #e45649;">static</span> <span style="color: #986801;">int</span> <span style="color: #a626a4;">search</span> (<span style="color: #986801;">int</span>[]<span style="color: #6a1868;">a</span>, <span style="color: #986801;">int</span> <span style="color: #6a1868;">x</span>)
<span style="color: #9ca0a4;">// </span><span style="color: #9ca0a4;">Effects:   if x is in a returns an index where </span>
<span style="color: #9ca0a4;">//  </span><span style="color: #9ca0a4;">x is stored; otherwise, returns -1</span>
</pre>
</div>


<ul class="org-ul">
<li>Precondition: None (i.e., <code>True</code>)</li>
<li>Underdetermined – what happens if <code>x</code> is in <code>a</code> more than once?</li>
</ul>



<p>
Yet Another Example
</p>


<p>
Yet Another Example
</p>


<p>
Specifications and Implementations
Minimality
minimal means fewer constraints on behavior (what does this say about the postcondition?)
Underdetermined behavior
More than one possible result per input allowed
Deterministic implementation
Only one result per input produced
Generality
More general if specification can handle a large class of inputs.  (What does this say about the precondition?)
</p>


<p>
Total vs. Partial Procedures
A procedure is total if its behavior is specified for all possible inputs. 
A partial procedure always has a precondition.
Partial procedures are less safe than total procedures.
Exception handling can be used to eliminate preconditions (more in next lecture…).
</p>


<p>
Bertrand Meyer’s View: Design by Contract
A programmer’s job is to produce solutions, not programs.
Software should be reliable.
Type safety, garbage collection, etc…
These are good
But they are not enough
Correctness is a relative notion
A program is correct relative to a specification
</p>

<p>
What does a Contract Look Like?
Consider the triple:  {P} S {Q}
P is the precondition (Requires clause)
Q is the postcondition (Effects clause)
S is the program text
The Customer (client) is obligated to establish P.
The Implementor (service) may assume P
The Customer is entitled to Q
The Implementor is obligated to provide Q
That’s it!
What happens when a Contract Breaks?
If everyone does their job, there is no problem!
If the precondition is not satisfied, the Customer is wrong!  (The client has a bug).
If the precondition is satisfied, but the postcondition is not, then the Service is wrong (The service has a bug).
The Client can’t do the Service’s job!
The Service can’t do the Client’s job!
Application of Contract Model to Debugging
Suppose you are fixing a fault in a program.
What justification is there for a proposed change?
 Example Context:
code considered correct
&#x2026;..
code identifed as wrong vs. proposed correct code
&#x2026;..
more code considered correct
Example
//Effects:  if arr is null throw NPE else return the number of occurrences of 0 in arr
public static in numZero (int[] arr) {
   int count = 0;
</p>

<p>
for (int i=1; i &lt; arr.length; i++) {
</p>

<p>
      if (arr[i] == 0) {count++}
   }
   return count;
}
What does the Client like?
Since preconditions are Client obligations, the Client would prefer not to have any!
From the Client’s perspective, “true” is the best precondition.  In general, weaker preconditions are better.
The Client is happy to have any postcondition that is strong enough to meet the Client’s needs.
What does the Server like?
Since preconditions are Server benefits, the Server would prefer to have lots of them!
From the Server’s perspective, “false” is the best precondition.  In general, stronger preconditions mean an easier job with the implementation.
The Server prefers weak postconditions.  Each additional constraint in a postcondition is an additional obligation on the Server.
Who should get preference?
In Business, the Customer is thought to be “always right”   This is a good model for software as well:
Tradeoffs should generally be made in favor of the client.  That is
minimize preconditions
provide usefully strong postconditions
But there are limits…
Problems with Eliminating Preconditions
Forcing the Server to handle “weird” cases can lead to inefficient, bulky (read “error prone”) code.
For “local” use, therefore, preconditions can be extremely powerful (and appropriate).
Example:  Consider the “partition” method in a quicksort routine (Liskov p. 49).  It would be weird to handle the case where the array indices were out of bounds.
More Problems with Eliminating Preconditions
What if the Implementer can’t provide a good “default” (ie Defensive Programming)?
Consider the following (horrible) code:
</p>

<p>
Dissecting the Square Root Example
What could possibly be a correct “default”?
Printing an error message?
Not a comforting thought to certain end users (ie pilots).
What could possibly be a reasonable return value?
The Lesson:  The Server is not in a position to define behavior.  That’s the Client’s job. (through the contract mechanism).
Meyer’s Perspective on Defensive Programming
Defensive programming:
leads to duplicate checks on preconditions and therefore code bloat.
leads to implementers checking preconditions when they have no idea what to do if the precondition is false.
leads to confusion over responsibility for ensuring certain constraints.
So, Meyer’s advice is, “Don’t do it!”
Your mileage may vary
Think about this in the context of preconditions and exception handling.
What are the implications for security?
</p>
</div>
</div>
</div>
</div>
</body>
</html>
